////////////////////////////////////////////////////////////////
# pragma once
////////////////////////////////////////////////////////////////
# include "Unit.h"
# include "dll.h"
////////////////////////////////////////////////////////////////
class Army {
public:
    static const string NAME[ RED ];
    Unit* king;
    vector <Unit*> bench; //                   out of play units
    //
    Army( Unit* king )
    : king( king )
    {
        dll::ahead( king );
    }
    ~Army(){
        while( king->next != king ){
            dll::purge( king->next );
        }
        delete king;
        for( Unit* p: bench ){
            delete p;
        }
    }
    Unit* insert( fig_t type, color_t color, Node* node );
    ////////////////////////////////////////////////////////////
    //   >next>    >next>                                :before
    // n        p         q       
    //   <prev<    <prev<
    ////////////////////////////////////////////////////////////
    //   >next>   ' bench:            >next>              :after
    // n        q |        n        p        q
    //   <prev<   |          <prev<
    ////////////////////////////////////////////////////////////
    void unlink( Unit* p );
    Unit* dance() {
        Unit* p{ bench.back() };
        bench.pop_back();
        p->prev->next = p->next->prev = p;
        return p;
    }
};
////////////////////////////////////////////////////////////////
ostream& operator <<( ostream& ostrm, const Army& army );
////////////////////////////////////////////////////////////////
// 2.1.24: A cylinder slides along a trough shaped like a
// dihedral angle with an opening angle of α. The edge of the
// dihedral angle is inclined at an angle β to the horizontal.
// The planes of the dihedral angle form equal angles with the
// horizon. Determine the acceleration of the cylinder. The
// coefficient of friction between the cylinder and the trough’s
// surface is μ
////////////////////////////////////////////////////////////////
//
//                                                              
// ``````````````````     /`````````````````````````````````````
// ````````````````````  /  /```````````````````````````````````
// `````````````````````` cyl /`````````````````````````````````
// ```````````````````````` ind /```````````````````````````````
// `````````````````````````` er  /`````````````````````````````
// ````````````````````````````\ /  /```````````````````````````
//                            ` \ α/                            
//                           β  `\/                             
//                                                              
////////////////////////////////////////////////////////////////
// #############################################################
// ## If we tilt the edge of the wedge at angle β and look from 
// # side view( they came from behind ), we'll have thus:
// #############################################################
// #        A R            side # Here R is the reaction from ##
// #        |                   # the wedge, and F is the force 
// #   F +-----+                # of friction, zo now let's look
// # <---|--+--|-------> mgsinβ # at the front view: ###########
// #     +-----+                ################################
// #--------|-------------------################################
// #        V mgcosβ            #          ###                  
// #                            #```.    ##   ##    .```````````
// ##############################`````. #   .N  # .````````````f
// # Here along points A and B ##```````.#.`  ##.``````````````r
// # where the cylinder and the #```````A`.###.`B``````````````o
// # wedge are in contact we'll #```````````.``````````````````nt
//// have 2 forces of friction equal to f = μN, zo F will be the 
//// sum of the two: F = 2f = 2μN, now we have to find N: //////
// =============================================================
// =============================================================
// ====================================== Nⱼ = Nsin(α/2) =======
// =============================================================
// =====`.  Nⱼ .     N             .`==== 2Nⱼ = mgcosβ, zo =====
// =======`.   .   .`            .`=============================
// =========`. . .` α/2        .`======== 2N = mgcosβ/sin(α/2) =
//  j A ======`.`. . .Nᵢ     .`=================================
// == | ========`.         .`============, for the acceleration:
// == | ==========`.  α  .`=====================================
// == +----> i =====`. .`================ ma = mgsinβ - 2μN = ==
// ===================`================== = mgsinβ - 
// ======================================       μmgcosβ/sin(α/2)
// =============================================================
// , zo a = g(sinβ - μcosβ/sin(α/2)) ///////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
